Revit 2027 API
AdaptiveComponentFamilyUtils.MakeAdaptivePoint Method
 Makes Reference Point an Adaptive Point or makes an Adaptive Point a Reference Point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void MakeAdaptivePoint(
	Document doc,
	ElementId refPointId,
	AdaptivePointType type
)
Public Shared Sub MakeAdaptivePoint (
	doc As Document,
	refPointId As ElementId,
	type As AdaptivePointType
)
public:
static void MakeAdaptivePoint(
	Document^ doc,
	ElementId^ refPointId,
	AdaptivePointType type
)
static member MakeAdaptivePoint :
        doc : Document *
        refPointId : ElementId *
        type : AdaptivePointType -> unit
Parameters
doc Document
 The Document
refPointId ElementId
 The ReferencePoint id
type AdaptivePointType
 The Adaptive Point Type
Exceptions
Exception | Condition
ArgumentException |  The ElementId refPointId does not correspond to a valid ReferencePoint. -or- The Element corresponding to ElementId refPointId does not belong to an Adaptive Family.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This operation failed.
See Also
Reference
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace